<!-- dflook/terraform-github-actions {"workspace":"app-token-username","backend":"8ac1965a4c5ff04becc4f0569b5d878649ad9d8278f9d4cb42a9db2be8694cf8","backend_type":"remote","plan_modifier":"9ebdcefa28ba58bd0b2d6fc795d575dba5541517ae08f41ba0945779d06b671e","plan_job_ref":"Job Test plan target and replace #274 at https://github.com/dflook/terraform-github-actions/actions/runs/3496421993","plan_hash":"94e21cca4bd571d2ca995eab4115afd57dab8f326c739b443a9506ec8fc3fa47","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __app-token-username__ workspace
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ foreach = "XifVxjlMpq" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #274](https://github.com/dflook/terraform-github-actions/actions/runs/3496421993)